/***********************************************************************************
*  Включение-выключение корзины. По умолчанию корзина включена. 
***********************************************************************************/

  -- Отключить корзину для сессии
  ALTER SESSION SET RECYCLEBIN=OFF;
  -- Отключить корзину
  ALTER SYSTEM SET RECYCLEBIN=OFF SCOPE=SPFILE;
  -- Включить корзину для сессии
  ALTER SESSION SET RECYCLEBIN=ON;
  -- Включить корзину
  ALTER SYSTEM SET RECYCLEBIN=ON SCOPE=SPFILE;

/***********************************************************************************
*  Просмотр удаленных (помещенных в корзину) объектов 
***********************************************************************************/

  -- только для данного пользователя
  select * from user_recyclebin;
  select * from recyclebin;
  -- все удаленные объекты
  select * from dba_recyclebin;
  
/***********************************************************************************
*  Восстанавливаем объект из корзины 
***********************************************************************************/
  
  -- востановить последению удаленную версию my_table
  flashback table my_table to before drop;
  -- востановить УКАЗАННУЮ удаленнную версию table1
  flashback table "BIN$CxaooGNESZa4GThzDSX5SQ==$0" to before drop;
  
/***********************************************************************************
*  Чистим корзину 
***********************************************************************************/
  -- удалить все версии таблицы my_table из корзины
  purge table my_table;
  -- удалить таблицу из корзины по системному имени
  purge table "BIN$0Vq5kNlvTS6G/uyKOlzdAw==$0";
   -- удалить все объекты пользователя "MOTOR" из тайблспейса TRNDATA.
  purge tablespace TRNDATA user MOTOR;
  -- удалить все объекты  из тайблспейса TRNDATA.
  purge tablespace TRNDATA;
  -- удалить все объекты из корзины текущего пользователя
  purge recyclebin;
  -- удалить все объекты из корзины, включая системные объеткты
  purge dba_recyclebin;  
